app/views/books/edit.html.erb

    <%= form.label :lector_id, "Lecteur" %>
    <%= form.collection_select :lector_id, Lector.all, :id, :full_name, { include_blank: true }, class: "form-control" %>
---
SELECT "lectors".* FROM "lectors"