app/views/books/index.html.erb

SELECT "lectors".* FROM "lectors" WHERE "lectors"."id" = 5 LIMIT 1
---
          <% if book.is_borrowed && book.lector %>
            <%= link_to "#{book.lector.first_name} #{book.lector.last_name}", lector_path(book.lector) %> <!-- Lien vers la page show du lector -->