app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("id", "title", "author", "is_borrowed", "date", "created_at", "updated_at", "lector_id") VALUES ('2b02957c-8c3f-437b-b3d3-d1af1c3d71d8', 'eqr', 'srtts', 0, NULL, '2025-01-25 14:16:24.455750', '2025-01-25 14:16:24.455750', NULL) RETURNING "id"

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "is_borrowed" = 1, "date" = '2025-01-30', "updated_at" = '2025-01-25 14:18:17.234790', "lector_id" = 5 WHERE "books"."id" = '87e4b6f2-3cc1-4420-814e-be974e8e8ed6'