app/controllers/lectors_controller.rb

SELECT "lectors".* FROM "lectors"
---
    def index
      @lectors = Lector.all

INSERT INTO "lectors" ("first_name", "last_name", "address", "email", "uuid", "created_at", "updated_at") VALUES ('dsd', 'sf', 'sd', 'sd@gjfds.com', '', '2025-01-25 12:29:46.579376', '2025-01-25 12:29:46.579376') RETURNING "id"
---
    def create
      @lector = Lector.new(lector_params)

      if @lector.save

UPDATE "lectors" SET "first_name" = 'Bob', "last_name" = 'Martin', "address" = '2 rue Chatelet 75001 Paris', "updated_at" = '2025-01-25 17:06:13.353176' WHERE "lectors"."id" = 1
---
    def update
      if @lector.update(lector_params)

DELETE FROM "lectors" WHERE "lectors"."id" = 1
---
    def destroy
      @lector.destroy

SELECT "lectors".* FROM "lectors" WHERE "lectors"."id" = 1 LIMIT 1
---
    def set_lector
      @lector = Lector.find(params[:id])